backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 10000, 2]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 100
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: lstm_1
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 50
      use_bias: true
    inbound_nodes:
    - - - lstm_1
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 50
      use_bias: true
    inbound_nodes:
    - - - lstm_1
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple
      - '4wEAAAAAAAAABAAAAAUAAAATAAAAcygAAAB8AFwCfQF9AnQAagGIAIgCZgJkAYgBZAKNA30DfAF8

        AnwDFAAXAFMAKQNOZwAAAAAAAAAAKQPaBXNoYXBl2gRtZWFu2gZzdGRkZXYpAtoBS9oNcmFuZG9t

        X25vcm1hbCkE2gRhcmdz2gZ6X21lYW7aC3pfbG9nX3NpZ21h2gdlcHNpbG9uKQPaCmJhdGNoX3Np

        emXaC2Vwc2lsb25fc3Rk2gpsYXRlbnRfZGltqQD6Okg6XERhdGEgU2NpZW5jZSBhbmQgQW5hbHl0

        aWNzXFByb2plY3RzXEJUUFxsc3RtX3ZhZVx2YWUucHnaCHNhbXBsaW5nHgAAAHMIAAAAAAEIAQoB

        CgE=

        '
      - null
      - !!python/tuple [1, 1.0, 50]
      function_type: lambda
      name: lambda_1
      output_shape: !!python/tuple [50]
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - &id001 {}
      - - dense_2
        - 0
        - 0
        - *id001
    name: lambda_1
  - class_name: RepeatVector
    config: {n: 10000, name: repeat_vector_1, trainable: true}
    inbound_nodes:
    - - - lambda_1
        - 0
        - 0
        - {}
    name: repeat_vector_1
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_2
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 100
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - repeat_vector_1
        - 0
        - 0
        - {}
    name: lstm_2
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_3
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 2
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - lstm_2
        - 0
        - 0
        - {}
    name: lstm_3
  name: model_1
  output_layers:
  - [lstm_3, 0, 0]
keras_version: 2.2.4
